# language: fa
ویژگی: مدیریت کالکشن‌ها

  سناریو: ایجاد کالکشن جدید
    فرض کنید سیستم در حالت اولیه است
    هنگامی که یک کالکشن جدید با نام "Test Collection" ایجاد می‌کنم
    آنگاه یک کالکشن با نام "Test Collection" باید در سیستم وجود داشته باشد

  سناریو: دریافت کالکشن با شناسه
    فرض کنید یک کالکشن با نام "API v1" در سیستم وجود دارد
    هنگامی که کالکشن را با شناسه آن دریافت می‌کنم
    آنگاه نام کالکشن دریافت شده باید "API v1" باشد

  سناریو: حذف کالکشن
    فرض کنید یک کالکشن با نام "To Be Deleted" در سیستم وجود دارد
    هنگامی که آن کالکشن را حذف می‌کنم
    آنگاه آن کالکشن نباید در سیستم وجود داشته باشد
